{
    "averageRating": "5,0",
    "reviewsCount": "29",
    "reviews": [
        {
            "name": "Heisenberg's Uncertainty Principle",
            "rating": "5,0",
            "reviewText": "(Übersetzt von Google) Diese Klinik ist ein Segen. Schnell, günstig, fürsorglich. Das Team war sehr höflich und engagiert, während es tatsächlich auf medizinische Bedenken hörte. Ich war schon zweimal dort und werde ihnen auch in Zukunft medizinische Bedürfnisse stellen.<br><br>(Original)<br>This clinic is a blessing. Quick, affordable, caring. The team were very polite, and engaging while actually listening to medical concerns. I have been there twice and will continue to take any future medical need to them."
        },
        {
            "name": "brandon edwards",
            "rating": "5,0",
            "reviewText": "(Übersetzt von Google) Ich war heute hier und hatte den angenehmsten Bürobesuch. Das Personal war sehr freundlich und unternimmt jeden Schritt, um die Sicherheit der Patienten und ihrer Mitarbeiter zu gewährleisten. Um den Besuch abzurunden, war Thuy, der Praktizierende, sehr gründlich und hörte auf meine Bedenken bezüglich des medizinischen Problems. Sie beeilte sich nicht, mich wie eine Nummer zu behandeln. Ich werde auf jeden Fall für meine zukünftigen medizinischen Bedürfnisse zurückkehren und ich kann die Love Thy Neighbor Klinik nur empfehlen !!!!<br><br>(Original)<br>I went here today and had the most pleasant office visit. The staff was very friendly and they are taking every step to ensure the safety of the patients and their staff. To top off the visit, Thuy, the practitioner, was very thorough and listened to my concerns with the medical issue. She didnt rush my visit treating me like a number.  I will definitely go back for my future medical needs and I highly recommend Love Thy Neighbor clinic!!!!"
        },
        {
            "name": "Edwin Aragon",
            "rating": "5,0",
            "reviewText": "(Übersetzt von Google) Dieser Ort ist versteckt, aber der Service nicht. Sie kümmern sich sehr schnell um Sie. Schneller als jede dringende Behandlung, bei der die Wartezeit immer mehr als 1 Stunde beträgt. Ihre Preise sind erschwinglich, und obwohl ich eine Versicherung habe, komme ich immer noch hierher und bezahle bar. Der Grund dafür ist, dass das Personal großartig ist und der Service schnell ist.<br><br>Ich kann dieses Hotel jedem empfehlen, der die langen Wartezeiten in anderen Notfallkliniken satt hat.<br><br>(Original)<br>This place is hidden, but the service isn't. They tend to you very quickly. Faster than any urgent care, where the wait time is always 1 hour +. Their rates are affordable, and while I have insurance, I still come here and pay cash. The reasoning behind it, is because the staff is great, and the service is quick. <br><br>I recommend this place to anyone who is tired of the long wait times at other urgent care clinics."
        },
        {
            "name": "Ryan Escobar",
            "rating": "5,0",
            "reviewText": "(Übersetzt von Google) Schnell und bequem zusammen mit einem super netten und professionellen Personal. Ich kann es meinen Freunden und meiner Familie nur empfehlen. Ich komme wieder!<br><br>(Original)<br>Quick and convenient along with a super nice and professional staff.  I would highly recommend to my friends and family.  I’ll be back!"
        },
        {
            "name": "Michael Goff",
            "rating": "5,0",
            "reviewText": "(Übersetzt von Google) Ich bin zum Nachfüllen von Rezepten gekommen, da ich im Moment ohne Hausarzt bin. Sie haben sich um alles gekümmert und waren so nett und professionell. Ich möchte von jetzt an einfach weiter kommen. War eine tolle Erfahrung für einen Arztbesuch. Twee, das Blut zog, tat es völlig schmerzlos. Ich kann ihr nicht genug dafür danken. Tolle kleine Nachbarschaftsklinik!<br><br>(Original)<br>I came for refills for prescriptions as I’m without a primary care physician at the moment.   They took care of everything and were so nice and professional.   I’d like to just keep coming there from now on.   Was a great experience overall for a doctor visit.   Twee that drew blood did it completely painless.     I can’t thank her enough for that.   Great little neighborhood clinic!"
        },
        {
            "name": "Angie Reyna",
            "rating": "5,0",
            "reviewText": "(Übersetzt von Google) Dieser Ort ist großartig. Die Leute sind wunderbar. Der Praktizierende, mit dem ich gesprochen hatte, nahm sich die Zeit, um mir meine Krankengeschichte anzuhören und ein Follow-up vorzuschlagen. Das Büro ist sauber und ordentlich und ich komme auf jeden Fall wieder.<br><br>(Original)<br>This place is great. The people are wonderful. The nurse practitioner I spoke to took the time to listen to my medical history and suggest follow up. The office is clean and organized and I'm definitely coming back."
        },
        {
            "name": "Lorena Zepeda",
            "rating": "5,0",
            "reviewText": "(Übersetzt von Google) So zufrieden mit meinem heutigen Besuch, sie waren so nett und es gab keine lange Wartezeit. Ich habe keine Versicherung, dieser Ort ist sehr erschwinglich. Sehr schön und sauber Vielen Dank!!<br><br>(Original)<br>So happy with my visit today, they were so nice and there wasn't a long wait. I don't have insurance, this place is very affordable. Very nice and clean. Thank you!!"
        },
        {
            "name": "Vicky Alejos",
            "rating": "5,0",
            "reviewText": "(Übersetzt von Google) Liebte diesen Ort wirklich. Kam wegen Grippesymptomen herein und musste nicht warten, wurde gerufen und sah den Arzt schnell. Wird ständige Arztpraxis sein.<br><br>(Original)<br>Really loved this place. Came in for flu symptoms and didn’t have to wait was called in and saw the doctor fast. Will be permanent doctors office."
        },
        {
            "name": "Paul Sampson",
            "rating": "5,0",
            "reviewText": "(Übersetzt von Google) Meine Frau, mein Sohn und ich brauchten Pflege. Wir suchten nach einer nahe gelegenen Klinik mit angemessenen Preisen. Wir sind froh, dass wir 'Love Thy Neighbour' gefunden haben. Die Angestellten waren sehr professionell, freundlich und herzlich. Sie sind gute Leute. Vor allem wurden unsere Anliegen sehr gut angesprochen.<br><br>(Original)<br>My wife, my son, and I needed care.  We searched for a nearby clinic with reasonable prices.  We are glad that we found 'Love Thy Neighbor'.  Staff members were very professional, friendly, and welcoming.  They are good folks.  Most importantly, our concerns were addressed very well.."
        },
        {
            "name": "Khalil Saad",
            "rating": "5,0",
            "reviewText": "(Übersetzt von Google) Meine Zwillinge waren krank, und ich wusste nicht, wie ich ihnen helfen sollte. Minuten, nachdem sie gemeinsam dort waren, übernahm das Team das Spiel, spielte mit ihnen, ließ sie entspannen und diagnostizierte sie. 20 Minuten rein und raus !! Ty für professionell und sympathisch!<br><br>(Original)<br>My twins where sick, and fussy I didn't know how to help them. Minutes after being there collectively the team took over, playing with them, making them relax, and all the while diagnosing them. 20 minutes in and out!! Ty for being professional, and personable!"
        }
    ]
}